{"pages":[{"title":"About Lapis0875","text":"Intro안녕하세요! 저는 고등학생 개발자 라피스라고 합니다. 종종 “이런게 있으면 좋겠다” 혹은 “이런건 어떻게 만드는걸까?” 싶은 것들을 직접 부딪혀보며 만들어보는걸 취미로 하고 있어요.","link":"/about/index.html"}],"posts":[{"title":"Hello_Hexo!.md","text":"","link":"/uncategorized/2020/03/Hello-Hexo-md/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/uncategorized/2020/03/hello-world/"},{"title":"Arduino에서 Serial을 사용해 출력할 때, 문자열과 변수의 값을 코드 한 줄로 출력하는 방법","text":"요즘 학교에서 아두이노를 사용해 LiDAR와 같은 센서들로부터 값을 읽어오고 그 값들을 바탕으로 모터를 제어하는 소스코드를 작성하고 있습니다. 추후 탱크의 형태로 만들어질 하드웨어에 연결해 RC 컨트롤러로 제어하거나 여러 센서들을 사용해 주변과 부딪히지 않고 스스로 움직이도록 하는 것이 목표입니다. 이를 위해 오늘은 LiDAR 센서로부터 값을 읽어오는 코드를 작성하고 있었습니다. 아두이노에서 계산한 값을 Serial 모니터로 출력하기 위해서는, 아두이노의 하드웨어에서 지원되는 Serial(HardwareSerial 이라고 합니다.)을 사용해 출력해야 합니다. 12Serial.println();Serial.print(); Serial 모니터에 문자열, 정수 등을 출력할 때에는 주로 이 두가지 메소드를 사용합니다. 헌데, 제가 변수의 값을 출력할때 자주 사용하던 방식대로 출력할 수 없었습니다. 12var = 10;Serial.println(\"var = \" + var); 위 코드와 같은 형태로 출력시 의도한대로 var = 10 이 출력되는것이 아닌, 전혀 다른 이상한 값들이 출력되더군요. 정말로 함수를 새로 만들어서 더 깔끔하게 출력할 수 있도록 해야할지 고민하던 도중, 구글링을 통해 보게된 스택오버플로우의 한 글은 제게 간단한 해결책을 제안했습니다. 12var = 10;Serial.println((String) \"var = \" + var); 이라는 코드였죠. “var = “ + var 이라는 문자열과 정수의 덧셈 결과를 문자열로 캐스팅하면 바로 사용이 가능했습니다. 앞으로는 번거롭게 여러줄의 Serial.print()를 사용하는 대신, 위 코드로 깔끔하면서도 보기 좋은 디버깅을 할 수 있겠네요 :D","link":"/Blog/2020/01/Blog-2020-01-13-AboutArduinoSerialPrintwithVariables/"},{"title":"2019년도 회고록","text":"어느덧 2019년이 마무리되고 2020년이 다가왔습니다. 제게 2019년은 이전 해와는 달리 보다 더 많은 일들에 도전했고, 더 많은 일을 해낸 해였습니다. 제게 의미있는 일들이 많았던 만큼 회고록을 통해 올 해 겪었던 여러가지 일들에 대해 적어보려 합니다. 1. Python과 카카오톡 챗봇2019년 8월, 저는 김왼손님의 왼손코딩 시리즈를 통해 파이썬의 기초를 공부했습니다. 그 후, 파이썬을 본격적으로 활용해보며 Closure, Decorator와 같은 문법들을 배웠고 Flask, discord.py와 같은 여러가지 모듈들에 대해 공부하고 다뤄보았습니다. 이전에 다른 언어들을 배웠기 때문인지, 빠르게 배워서 빠르게 쓸 수 있었던 언어였죠. 올해 Python 3.7.4 버전을 배워 만들어본 것들은 여러가지가 있지만, 그중에서도 특히 의미가 있는 프로젝트를 고르자면 제 고등학교의 카카오톡 챗봇의 스킬서버를 고르겠습니다. 이전에는 사용해 보기만 하던 카카오톡 챗봇을 직접 개발해보니 재밌고 유익한 경험이 되었던 것 같고, 이렇게 만든 챗봇을 고등학교의 학생들, 교사들이 사용할 수 있도록 서비스해보며 뿌듯함을 느꼈습니다. 현재는 급식표 기능이 서비스되고 있으며, 추후 여러가지 기능들을 추가할 예정입니다. 2. 챗봇톤 참가비록 지식이 많이 모자란 상태에서 참여한 해커톤이었지만, 많은 것들을 배울 수 있었습니다.다양한 분야의 팀원들과 함께 협업해본 경험, 코사인 유사도 알고리즘과 파이썬으로 형태소 분석하기, 챗봇 개발하기 등 다양한 경험을 해 본 유익한 시간이었던 것 같습니다. 그때 받아왔던 보라색 후드집업은 잘 입고 있어요. (의외로 마음에 들었어요 ㅎㅎ) 3. 메이커 활동메이커 활동이 무엇인지는 아무것도 모른 채, 처음에는 교내에서 프로그래밍을 같이 할 학생들을 모아보고자 자율동아리를 창설하려고 했어요. 그러나, 일반 고등학교였기 때문에 당연한 결과였는지 자율동아리를 설립하기 위한 최소 인원을 채우지 못했고, 방향을 틀어 ‘무언가를 만든다’ 라는 원초적인 목적으로 자율동아리를 만들어, 8명의 인원으로 메이커 동아리를 창설하게 되었습니다. 교내에 메이커 스페이스가 존재했는데, 이곳에서 3D 프린터를 사용해보고, 아두이노를 다뤄보며, 납땜을 해보는 등 다양한 활동들을 경험할 수 있었습니다. 축제 기간과 학교 설명회 기간에 그동안 만들었던 여러 작품들을 공개했는데, 특히나 학교 설명회 때가 가장 기억에 남네요. 기말고사가 한 달 남아있던 와중에 2주 정도의 시간을 들여 의수와 로봇 팔을 만들고, 교내 메이커 활동을 소개하기 위한 발표를 준비했던 경험은 재밌으면서도 긴장되었습니다. 발표는 아쉬웠지만, 이걸 계기로 내가 다음번에 또 발표를 하게 된다면 어떠한 점을 고쳐야 할지 보다 확실히 알게 되었으며, 발표를 더 많이 하면 할수록 내가 사람들 앞에 서는 것을 두려워하지 않게 되어간다는 사실을 깨달았습니다. 4. 관심 분야의 확장저는 ‘’내가 즐기던 게임들을 직접 만들어보고 싶다’ 라’는 발상에서 프로그래밍을 시작하게 되었습니다. 그렇기 때문에, 이전에는 제가 관심을 가지던 분야는 주로 게임 개발에 한정되어 있었죠. 허나 지금은 보다 다양한 프로그램들을 접하고 직접 만들어보며 제가 관심을 가지고 있던 분야가 넓어졌습니다. 이제는 앱, 웹 개발에도 흥미를 가지고 있으며 머신러닝이라는 분야에 굉장한 관심을 가지고 있습니다. 여전히 게임 개발도 관심을 가지고 있고, Unity를 공부하고 있죠. C#으로 WPF 프로그램을 만들어보며 데스크탑 앱 개발에 입문하게 되었고, Java로 안드로이드 앱을 개발하며 모바일 앱 개발에 입문하게 되었습니다. 다음에 기회가 된다면 크로스 플랫폼 앱 개발을 공부해 Discord와 같이 플랫폼에 구애받지 않고 사용 가능한 앱을 개발해 보고 싶어지기도 했습니다. 제가 관심을 갖게 된 분야가 넓어진 만큼, 프로그래밍을 향한 열정도 더 깊어진 것 같아요. 2020년에는 더 많은 것들을 배우고, 만들어보고 싶습니다. 이정도면 올 한 해 동안의 주요한 경험들을 다 적어둔 것 같아요. 2020년을 마무리하면서 또 어떠한 경험들을 적게 될지, 그리고 또 무엇을 배우며 무엇을 만들게 될지 기대됩니다.","link":"/Blog/2019/12/Blog-2019-12-31-memoirs/"}],"tags":[{"name":"blog, Arduino, C++","slug":"blog-Arduino-C","link":"/tags/blog-Arduino-C/"},{"name":"회고록","slug":"회고록","link":"/tags/%ED%9A%8C%EA%B3%A0%EB%A1%9D/"}],"categories":[{"name":"Blog","slug":"Blog","link":"/categories/Blog/"}]}